# الدرس 10 - المشروع النهائي: مبرمج صغير يحل التحديات!

# 1. قائمة ثنائية بالأشياء ومساحتها (بالأمتار المربعة)
items = [
    ["سرير", 3],
    ["مكتب", 2],
    ["ألعاب", 2],
    ["لمبة", 1],
    ["رفوف كتب", 2],
    ["روبوت مساعد", 1],
    ["أريكة", 1],
    ["تلفاز", 2],
]

# 2. عرض عدد هذه الأشياء
print("عدد الأشياء المتاحة:", len(items))

# 3. طباعة هذه الأشياء مع المساحات
print("الأشياء المتوفرة:")
for piece in items:
    print("-", piece[0], "يحتاج", piece[1], "متر")

# 4. أخذ 5 اختيارات من المستخدم وتخزينها في قائمة
print("\nاختر 5 أشياء من القائمة (اكتب الاسم كما هو ظاهر):")

choice1 = input("اختيار 1: ")
choice2 = input("اختيار 2: ")
choice3 = input("اختيار 3: ")
choice4 = input("اختيار 4: ")
choice5 = input("اختيار 5: ")

chosen = [choice1, choice2, choice3, choice4, choice5]

# 5. حساب المساحة التي تحتاجها هذه الأشياء
total_space = 0
for choice in chosen:
    for piece in items:
        if choice == piece[0]:
            total_space = total_space+piece[1]

# 6. يخبرك إن كانت الأشياء ستناسب الغرفة أم لا
print("\nالمساحة المطلوبة:", total_space, "متر مربع")
if total_space > 10:
    print("❌ المساحة لا تكفي لهذه الأشياء.")
else:
    print("✅ ممتاز! يمكن وضع الأشياء في الغرفة.")

# 7. عرض الأشياء التي اختارها المستخدم بعد ترتيبها حسب الاسم
sorted_items = sorted(chosen)
print("الأشياء التي اخترتها بعد الترتيب:")
for item in sorted_items:
    print("-", item)
